ams/src/DataProcessors/AMS_УправлениеЗапасами/AMS_УправлениеЗапасами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>AMS_УправлениеЗапасами</name>
</mdclass:DataProcessor>

ams/src/InformationRegisters/AMS_РеквизитыНоменклатуры/AMS_РеквизитыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AMS_РеквизитыНоменклатуры</name>
  <resources>
    <name>МаксимальныйОбъемЗамеса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МинимальныйОбъемЗамеса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоФабрикатаВУпаковке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.AMS_НоменклатураВид</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.AMS_НоменклатураТип</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>EnumRef.AMS_НоменклатураКатегория</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>EnumRef.AMS_НоменклатураНазначение</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.AMS_НомеклатураСтатус</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/Enums/AMS_НоменклатураВид/AMS_НоменклатураВид.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AMS_НоменклатураВид</name>
  <enumValues>
    <name>Непрофессиональная</name>
  </enumValues>
  <enumValues>
    <name>Профессиональная</name>
  </enumValues>
</mdclass:Enum>

ams/src/Enums/AMS_НоменклатураТип/AMS_НоменклатураТип.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AMS_НоменклатураТип</name>
  <enumValues>
    <name>БытоваяХимия</name>
  </enumValues>
  <enumValues>
    <name>Косметика</name>
  </enumValues>
  <enumValues>
    <name>ХозТовары</name>
  </enumValues>
</mdclass:Enum>

ams/src/Enums/AMS_НоменклатураКатегория/AMS_НоменклатураКатегория.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AMS_НоменклатураКатегория</name>
  <enumValues>
    <name>ДляВанны</name>
  </enumValues>
  <enumValues>
    <name>ДляВолос</name>
  </enumValues>
  <enumValues>
    <name>ДляДетей</name>
  </enumValues>
  <enumValues>
    <name>ДляДома</name>
  </enumValues>
  <enumValues>
    <name>МылоЖидкое</name>
  </enumValues>
  <enumValues>
    <name>ДляЛица</name>
  </enumValues>
  <enumValues>
    <name>ДляКухни</name>
  </enumValues>
  <enumValues>
    <name>ДляОфиса</name>
  </enumValues>
  <enumValues>
    <name>ДляРук</name>
  </enumValues>
  <enumValues>
    <name>ДляТела</name>
  </enumValues>
</mdclass:Enum>

ams/src/Enums/AMS_НоменклатураНазначение/AMS_НоменклатураНазначение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AMS_НоменклатураНазначение</name>
  <enumValues>
    <name>Волосы</name>
  </enumValues>
  <enumValues>
    <name>Дети</name>
  </enumValues>
  <enumValues>
    <name>Кухня</name>
  </enumValues>
  <enumValues>
    <name>КухняМашины</name>
  </enumValues>
  <enumValues>
    <name>Лицо</name>
  </enumValues>
  <enumValues>
    <name>Мебель</name>
  </enumValues>
  <enumValues>
    <name>Мойка</name>
  </enumValues>
  <enumValues>
    <name>МылоЖидкое</name>
  </enumValues>
  <enumValues>
    <name>МылоХоз</name>
  </enumValues>
  <enumValues>
    <name>Накипь</name>
  </enumValues>
  <enumValues>
    <name>Насекомые</name>
  </enumValues>
  <enumValues>
    <name>Освежитель</name>
  </enumValues>
  <enumValues>
    <name>Пол</name>
  </enumValues>
  <enumValues>
    <name>Посуда</name>
  </enumValues>
  <enumValues>
    <name>Ржавчина</name>
  </enumValues>
  <enumValues>
    <name>Руки</name>
  </enumValues>
  <enumValues>
    <name>Санитария</name>
  </enumValues>
  <enumValues>
    <name>Синька</name>
  </enumValues>
  <enumValues>
    <name>Смазка</name>
  </enumValues>
  <enumValues>
    <name>Спец</name>
  </enumValues>
  <enumValues>
    <name>Стекло</name>
  </enumValues>
  <enumValues>
    <name>Стирка</name>
  </enumValues>
  <enumValues>
    <name>Тело</name>
  </enumValues>
  <enumValues>
    <name>Утюг</name>
  </enumValues>
  <enumValues>
    <name>ЧисткаТруб</name>
  </enumValues>
</mdclass:Enum>

ams/src/Enums/_СтатусыСпецификаций/_СтатусыСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>_СтатусыСпецификаций</name>
  <enumValues>
    <name>НеСогласована</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
</mdclass:Enum>

ams/src/Catalogs/_ВариантыСпецификацийНоменклатуры/_ВариантыСпецификацийНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>_ВариантыСпецификацийНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef._СтатусыСпецификаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопускНаЗамес</name>
    <comment>Допустимое отклонение от нормы в одном замесе</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопускНаУпаковку</name>
    <comment>Допустимое отклонение от нормы в одном замесе</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереработкаБрака</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/DataProcessors/AMS_УправлениеЗапасами/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    НачалоПериода = ТекущаяДатаСеанса() - 365*24*3600;
	
	Элементы.Цех.СписокВыбора.Добавить(AMS_ВызовСервера.Цех1());
    Элементы.Цех.СписокВыбора.Добавить(AMS_ВызовСервера.Цех2());
    Элементы.Цех.СписокВыбора.Добавить(AMS_ВызовСервера.Цех3());
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ОтборПоЦеху И Не ЗначениеЗаполнено(Цех) Тогда 
		Если AMS_ВызовСервера.ДоступнаРоль("_Цех1") Тогда
			Цех = AMS_ВызовСервера.Цех1();
		
		ИначеЕсли AMS_ВызовСервера.ДоступнаРоль("_Цех2") Тогда
			Цех = AMS_ВызовСервера.Цех2();
		
		ИначеЕсли AMS_ВызовСервера.ДоступнаРоль("_Цех3") Тогда
			Цех = AMS_ВызовСервера.Цех3();
		
		ИначеЕсли AMS_ВызовСервера.ДоступнаРоль("_Цех4") Тогда
			Цех = AMS_ВызовСервера.Цех4();
		
		Иначе
			Цех = AMS_ВызовСервера.Цех1();
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ (ОтборСкладыПродукции Или ОтборСкладыМатериалов Или ОтборСкладыПрочие) Тогда 
		ОтборСкладыПродукции = Истина;
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	СформироватьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоЦехуПриИзменении(Элемент)
	СформироватьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ЦехПриИзменении(Элемент)
    СформироватьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСкладыПродукцииПриИзменении(Элемент)
	СформироватьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСкладыМатериаловПриИзменении(Элемент)
	СформироватьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСкладаПрочиеПриИзменении(Элемент)
	СформироватьОтчет();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИерархияНоменклатуры

&НаКлиенте
Процедура ИерархияНоменклатурыПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ИерархияНоменклатурыПриАктивизацииСтрокиОбработчикОжидания",0.1,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИерархияНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
    Имя = Поле.Имя;
	
	Номенклатура = Элемент.ТекущиеДанные.Номенклатура;
    
    Если Имя = "ТоварыНомерПоПорядку" или Имя = "ТоварыНоменклатура" или Имя = "ТоварыУпаковка" Тогда 
        ПоказатьЗначение(,Номенклатура);
		
	Иначе
 	    Если Имя = "ТоварыСклад" Тогда 
	        Склад = AMS_ВызовСервера.СкладПродукции();
			
		ИначеЕсли Имя = "ТоварыБрак" Тогда
			Склад = AMS_ВызовСервера.СкладБракованнойПродукции();
			
		ИначеЕсли Имя = "ТоварыКарантин" Тогда 
			Склад = AMS_ВызовСервера.СкладКарантин();
			
	    ИначеЕсли Имя = "ТоварыЦех1" Тогда 
	        Склад = AMS_ВызовСервера.Цех1();
			
	    ИначеЕсли Имя = "ТоварыЦех2" Тогда 
	        Склад = AMS_ВызовСервера.Цех2();
			
	    ИначеЕсли Имя = "ТоварыЦех3" Тогда 
	        Склад = AMS_ВызовСервера.Цех3();
			
	    ИначеЕсли Имя = "ТоварыЦех4" Тогда 
	        Склад = AMS_ВызовСервера.Цех4();
			
 	    ИначеЕсли Имя = "ТоварыЦех1_" Тогда 
			Склад = AMS_ВызовСервера.Цех1_МатериалыВПроизводстве();
			
 	    ИначеЕсли Имя = "ТоварыЦех2_" Тогда 
			Склад = AMS_ВызовСервера.Цех2_МатериалыВПроизводстве();
			
 	    ИначеЕсли Имя = "ТоварыЦех3_" Тогда 
			Склад = AMS_ВызовСервера.Цех3_МатериалыВПроизводстве();
			
 	    ИначеЕсли Имя = "ТоварыЦех4_" Тогда 
			Склад = AMS_ВызовСервера.Цех4_МатериалыВПроизводстве();
			
 	    ИначеЕсли Имя = "ТоварыЛаб" Тогда 
			Склад = AMS_ВызовСервера.СкладЛаборатория();
			
 	    ИначеЕсли Имя = "ТоварыМосква" Тогда 
			Склад = AMS_ВызовСервера.СкладМосква();
			
 	    ИначеЕсли Имя = "ТоварыМО" Тогда 
			Склад = AMS_ВызовСервера.СкладМО();
			
	    ИначеЕсли Имя = "ТоварыСкладКомпании" Тогда 
	        Склад = AMS_ВызовСервера.СкладКомпании();
			
	    ИначеЕсли Имя = "ТоварыТНЦ" Тогда 
	        Склад = AMS_ВызовСервера.СкладТНЦ();
			
		ИначеЕсли Имя = "ТоварыРасход" Тогда 
	        Склад = AMS_ВызовСервера.СкладРасходныхМатериалов();
	    КонецЕсли;
	        
	    Отбор = Новый Структура;
	    Отбор.Вставить("Номенклатура",Номенклатура);
        Отбор.Вставить("Склад",Склад);  
	    
		Период = Новый СтандартныйПериод;
		Период.Вариант       = ВариантСтандартногоПериода.ПроизвольныйПериод;
		Период.ДатаНачала    = НачалоПериода;
		Период.ДатаОкончания = КонецГода(ОбщегоНазначенияКлиент.ДатаСеанса());
	    
	    ПользовательскиеНастройки = Новый Структура;
	    ПользовательскиеНастройки.Вставить("Период",Период);
	        
	    ПараметрыФормы = Новый Структура;
	    ПараметрыФормы.Вставить("СформироватьПриОткрытии",Истина);
	    ПараметрыФормы.Вставить("КлючНазначенияИспользования","УпрЗапасами" + Номенклатура + Склад);
	    ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов",Ложь);
	    ПараметрыФормы.Вставить("Отбор",Отбор);
		ПараметрыФормы.Вставить("КлючВарианта","ДвижениеТоваров");
		ПараметрыФормы.Вставить("ПользовательскиеНастройки",
			ПолучитьИзВременногоХранилища(AMS_ВызовСервера.ПолучитьАдресПользовательскиеНастройки(
				"AMS_ДвижениеТоваров", ПользовательскиеНастройки, "ДвижениеТоваров")));

		ОткрытьФорму("Отчет.AMS_ДвижениеТоваров.Форма",ПараметрыФормы);
    КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПродукция

&НаКлиенте
Процедура ПродукцияПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ПродукцияПриАктивизацииСтрокиОбработчикОжидания",0.1,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
    
    Имя = Поле.Имя;
    Номенклатура = Элемент.ТекущиеДанные.Номенклатура;
    
    Если Имя = "ПродукцияНомерПоПорядку" или Имя = "ПродукцияНоменклатура" или Имя = "ПродукцияЕд" Тогда 
        ПоказатьЗначение(,Номенклатура);
		
	Иначе
 	    Если Имя = "ПродукцияСклад" Тогда 
	        Склад = AMS_ВызовСервера.СкладПродукции();
	        
	    ИначеЕсли Имя = "ПродукцияЦех1" Тогда 
	        Склад = AMS_ВызовСервера.Цех1();
	        
	    ИначеЕсли Имя = "ПродукцияЦех2" Тогда 
	        Склад = AMS_ВызовСервера.Цех2();
	        
	    ИначеЕсли Имя = "ПродукцияЦех3" Тогда 
	        Склад = AMS_ВызовСервера.Цех3();
	        
	    ИначеЕсли Имя = "ПродукцияЦех4" Тогда 
	        Склад = AMS_ВызовСервера.Цех4();
	    КонецЕсли;
	        
	    Отбор = Новый Структура;
	    Отбор.Вставить("Номенклатура",Номенклатура);
        Отбор.Вставить("Склад",Склад);  
	    
		Период = Новый СтандартныйПериод;
		Период.Вариант       = ВариантСтандартногоПериода.ПроизвольныйПериод;
		Период.ДатаНачала    = НачалоПериода;
		Период.ДатаОкончания = КонецГода(ОбщегоНазначенияКлиент.ДатаСеанса());
	    
	    ПользовательскиеНастройки = Новый Структура;
	    ПользовательскиеНастройки.Вставить("Период",Период);
	        
	    ПараметрыФормы = Новый Структура;
	    ПараметрыФормы.Вставить("СформироватьПриОткрытии",Истина);
	    ПараметрыФормы.Вставить("КлючНазначенияИспользования","УпрЗапасами" + Номенклатура + Склад);
	    ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов",Ложь);
	    ПараметрыФормы.Вставить("Отбор",Отбор);
		ПараметрыФормы.Вставить("КлючВарианта","ДвижениеТоваров");
		ПараметрыФормы.Вставить("ПользовательскиеНастройки",ПолучитьИзВременногоХранилища(AMS_ВызовСервера.ПолучитьАдресПользовательскиеНастройки("AMS_ДвижениеТоваров",ПользовательскиеНастройки,"ДвижениеТоваров")));

		ОткрытьФорму("Отчет.AMS_ДвижениеТоваров.Форма",ПараметрыФормы);
    КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПродукцияСписокСпецификаций

&НаКлиенте
Процедура ПродукцияСписокСпецификацийПриАктивизацииСтроки(Элемент)
    Стр = Элемент.ТекущиеДанные;
    
    Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СпецификацияПродукции = Стр.Спецификация;
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияСписокСпецификацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;
    ПоказатьЗначение(,Элемент.ТекущиеДанные.Спецификация);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалы

&НаКлиенте
Процедура МатериалыПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("МатериалыПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
    
    Имя = Поле.Имя;
    Номенклатура = Элемент.ТекущиеДанные.Номенклатура;
    
    Если Имя = "МатериалыНомерПоПорядку" или Имя = "МатериалыНоменклатура" или Имя = "МатериалыЕд" Тогда 
        ПоказатьЗначение(,Номенклатура);
		
	Иначе
 	    Если Имя = "МатериалыСклад" Тогда 
	        Склад = AMS_ВызовСервера.СкладПродукции();
			
	    ИначеЕсли Имя = "МатериалыЦех1" Тогда 
	        Склад = AMS_ВызовСервера.Цех1();
	        
	    ИначеЕсли Имя = "МатериалыЦех2" Тогда 
	        Склад = AMS_ВызовСервера.Цех2();
	        
	    ИначеЕсли Имя = "МатериалыЦех3" Тогда 
	        Склад = AMS_ВызовСервера.Цех3();
	        
	    ИначеЕсли Имя = "МатериалыЦех4" Тогда 
	        Склад = AMS_ВызовСервера.Цех4();
	    КонецЕсли;
	        
	    Отбор = Новый Структура;
	    Отбор.Вставить("Номенклатура",Номенклатура);
        Отбор.Вставить("Склад",Склад);  
	    
		Период = Новый СтандартныйПериод;
		Период.Вариант       = ВариантСтандартногоПериода.ПроизвольныйПериод;
		Период.ДатаНачала    = НачалоПериода;
		Период.ДатаОкончания = КонецГода(ОбщегоНазначенияКлиент.ДатаСеанса());
	    
	    ПользовательскиеНастройки = Новый Структура;
	    ПользовательскиеНастройки.Вставить("Период",Период);
	        
	    ПараметрыФормы = Новый Структура;
	    ПараметрыФормы.Вставить("СформироватьПриОткрытии",Истина);
	    ПараметрыФормы.Вставить("КлючНазначенияИспользования","УпрЗапасами" + Номенклатура + Склад);
	    ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов",Ложь);
	    ПараметрыФормы.Вставить("Отбор",Отбор);
		ПараметрыФормы.Вставить("КлючВарианта","ДвижениеТоваров");
		ПараметрыФормы.Вставить("ПользовательскиеНастройки",ПолучитьИзВременногоХранилища(AMS_ВызовСервера.ПолучитьАдресПользовательскиеНастройки("AMS_ДвижениеТоваров",ПользовательскиеНастройки,"ДвижениеТоваров")));

		ОткрытьФорму("Отчет.AMS_ДвижениеТоваров.Форма",ПараметрыФормы);
    КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПродукцияФабрикаты

&НаКлиенте
Процедура ПродукцияФабрикатыПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ПродукцияФабрикатыПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияФабрикатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;
    ПоказатьЗначение(,Элемент.ТекущиеДанные.Номенклатура);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалыСписокСпецификаций

&НаКлиенте
Процедура МатериалыСписокСпецификацийПриАктивизацииСтроки(Элемент)
    Стр = Элемент.ТекущиеДанные;
    
    Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СпецификацияМатериала = Стр.Спецификация;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСписокСпецификацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;
    ПоказатьЗначение(,Элемент.ТекущиеДанные.Спецификация);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКлассификаторы

&НаКлиенте
Процедура КлассификаторыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
    
    Номенклатура = Элемент.ТекущиеДанные.Номенклатура;
    
    ПоказатьЗначение(,Номенклатура);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПродукцияАналитика

&НаКлиенте
Процедура ПродукцияАналитикаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
    Имя = Поле.Имя;
	
	Номенклатура = Элемент.ТекущиеДанные.Номенклатура;
    
    Если Имя = "ПродукцияАналитикаАртикул" Или Имя = "ПродукцияАналитикаНоменклатура" Или Имя = "ПродукцияАналитикаСклад" Тогда
		СтандартнаяОбработка = Ложь;
        ПоказатьЗначение(,Номенклатура);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияАналитикаСтатусПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПродукцияАналитика.ТекущиеДанные;
	Номенклатура  = ТекущиеДанные.Номенклатура;
	Статус        = ТекущиеДанные.Статус;
	
	ЗаписатьРеквизитНоменклатуры("Статус", Номенклатура, Статус);
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияАналитикаБрендПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПродукцияАналитика.ТекущиеДанные;
	Номенклатура  = ТекущиеДанные.Номенклатура;
	Бренд         = ТекущиеДанные.Бренд;

	ЗаписатьРеквизитНоменклатуры("Бренд", Номенклатура, Бренд);
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияАналитикаВидПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПродукцияАналитика.ТекущиеДанные;
	Номенклатура  = ТекущиеДанные.Номенклатура;
	Вид           = ТекущиеДанные.Вид;
	
	ЗаписатьРеквизитНоменклатуры("Вид", Номенклатура, Вид);
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияАналитикаТипПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПродукцияАналитика.ТекущиеДанные;
	Номенклатура  = ТекущиеДанные.Номенклатура;
	Тип           = ТекущиеДанные.Тип;

	ЗаписатьРеквизитНоменклатуры("Тип", Номенклатура, Тип);
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияАналитикаКатегорияПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПродукцияАналитика.ТекущиеДанные;
	Номенклатура  = ТекущиеДанные.Номенклатура;
	Категория     = ТекущиеДанные.Категория;

	ЗаписатьРеквизитНоменклатуры("Категория", Номенклатура, Категория);
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияАналитикаНазначениеПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПродукцияАналитика.ТекущиеДанные;
	Номенклатура  = ТекущиеДанные.Номенклатура;
	Назначение    = ТекущиеДанные.Назначение;

	ЗаписатьРеквизитНоменклатуры("Назначение", Номенклатура, Назначение);
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияАналитикаМаксимальныйОбъемЗамесаПриИзменении(Элемент)
	ТекущиеДанные           = Элементы.ПродукцияАналитика.ТекущиеДанные;
	Номенклатура            = ТекущиеДанные.Номенклатура;
	МаксимальныйОбъемЗамеса = ТекущиеДанные.МаксимальныйОбъемЗамеса;

	ЗаписатьРеквизитНоменклатуры("МаксимальныйОбъемЗамеса", Номенклатура, МаксимальныйОбъемЗамеса);
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияАналитикаМинимальныйОбъемЗамесаПриИзменении(Элемент)
	ТекущиеДанные          = Элементы.ПродукцияАналитика.ТекущиеДанные;
	Номенклатура           = ТекущиеДанные.Номенклатура;
	МинимальныйОбъемЗамеса = ТекущиеДанные.МинимальныйОбъемЗамеса;

	ЗаписатьРеквизитНоменклатуры("МинимальныйОбъемЗамеса", Номенклатура, МинимальныйОбъемЗамеса);
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияАналитикаКоличествоФабрикатаВУпаковкеПриИзменении(Элемент)
	ТекущиеДанные                = Элементы.ПродукцияАналитика.ТекущиеДанные;
	Номенклатура                 = ТекущиеДанные.Номенклатура;
	КоличествоФабрикатаВУпаковке = ТекущиеДанные.КоличествоФабрикатаВУпаковке;

	ЗаписатьРеквизитНоменклатуры("КоличествоФабрикатаВУпаковке", Номенклатура, КоличествоФабрикатаВУпаковке);
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияАналитикаКатегорияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Массив = Новый Массив();
	
	Стр = Элементы.ПродукцияАналитика.ТекущиеДанные;
	
	Если Стр.Вид = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураВид.Непрофессиональная")
		И Стр.Тип = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураТип.БытоваяХимия") Тогда

		Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.ДляВанны"));		
		Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.ДляДома"));		
		Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.ДляКухни"));
				
	ИначеЕсли Стр.Вид = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураВид.Профессиональная")
		И Стр.Тип = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураТип.БытоваяХимия") Тогда
		
		Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.ДляВанны"));		
		Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.ДляОфиса"));		
		Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.ДляКухни"));

	ИначеЕсли Стр.Вид = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураВид.Непрофессиональная")
		И Стр.Тип = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураТип.Косметика") Тогда
		
		Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.МылоЖидкое"));		
		Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.ДляВолос"));		
		Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.ДляДетей"));		
		Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.ДляЛица"));		
		Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.ДляРук"));		
		Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.ДляТела"));		

	ИначеЕсли Стр.Вид = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураВид.Профессиональная")
		И Стр.Тип = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураТип.Косметика") Тогда
		
		Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.МылоЖидкое"));	
	КонецЕсли;	
	
	Элементы.ПродукцияАналитикаКатегория.СписокВыбора.ЗагрузитьЗначения(Массив);
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияАналитикаНазначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Массив = Новый Массив();
	
	Стр = Элементы.ПродукцияАналитика.ТекущиеДанные;
	
	Если Стр.Вид = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураВид.Непрофессиональная")
		И Стр.Тип = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураТип.БытоваяХимия") Тогда
		
		Если Стр.Категория = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.ДляВанны") Тогда
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Синька"));		
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.ЧисткаТруб"));		
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Стирка"));
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.МылоХоз"));
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Санитария"));
		
		ИначеЕсли Стр.Категория = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.ДляДома") Тогда
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Насекомые"));		
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Мебель"));		
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Пол"));
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Стекло"));
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Утюг"));
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Мойка"));
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Смазка"));
			
		ИначеЕсли Стр.Категория = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.ДляКухни") Тогда
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Кухня"));		
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Накипь"));		
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Посуда"));
		КонецЕсли;
				
	ИначеЕсли Стр.Вид = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураВид.Профессиональная")
		И Стр.Тип = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураТип.БытоваяХимия") Тогда
		
		Если Стр.Категория = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.ДляВанны") Тогда
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Освежитель"));		
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.ЧисткаТруб"));		
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Санитария"));	
				
		ИначеЕсли Стр.Категория = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.ДляОфиса") Тогда
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Мебель"));		
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Пол"));		
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Стекло"));
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Мойка"));
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Ржавчина"));
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Спец"));
			
		ИначеЕсли Стр.Категория = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.ДляКухни") Тогда
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.КухняМашины"));
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Посуда"));
		КонецЕсли;

	ИначеЕсли Стр.Вид = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураВид.Непрофессиональная")
		И Стр.Тип = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураТип.Косметика") Тогда
		
		Если Стр.Категория = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.МылоЖидкое") Тогда
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.МылоЖидкое"));
			
		ИначеЕсли Стр.Категория = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.ДляВолос") Тогда
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Волосы"));
			
		ИначеЕсли Стр.Категория = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.ДляДетей") Тогда
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Дети"));
			
		ИначеЕсли Стр.Категория = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.ДляЛица") Тогда
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Лицо"));
			
		ИначеЕсли Стр.Категория = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.ДляРук") Тогда
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Руки"));
			
		ИначеЕсли Стр.Категория = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.ДляТела") Тогда
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.Тело"));
		КонецЕсли;

	ИначеЕсли Стр.Вид = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураВид.Профессиональная")
		И Стр.Тип = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураТип.Косметика") Тогда
		
		Если Стр.Категория = ПредопределенноеЗначение("Перечисление.AMS_НоменклатураКатегория.МылоЖидкое") Тогда
			Массив.Добавить(ПредопределенноеЗначение("Перечисление.AMS_НоменклатураНазначение.МылоЖидкое"));
		КонецЕсли;
	КонецЕсли;	
	
	Элементы.ПродукцияАналитикаНазначение.СписокВыбора.ЗагрузитьЗначения(Массив);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьОтчет(Команда)
	СформироватьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ТабДок = Новый ТабличныйДокумент;
	
	ПоказатьНоменклатуруПоставщиков(ТабДок,Истина);
	
	ИдентификаторПечатнойФормы = "НоменклатураПоставщиков";
    НазваниеПечатнойФормы = НСтр("ru = 'Таблица соответствия наименований номенклатуры'");
    
    Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
        ТабДок.Показать(НазваниеПечатнойФормы);
		//ДокументыПечатались = Истина;
        Возврат;
    КонецЕсли;     
	МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");     
	КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	ПечатнаяФорма = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета = НазваниеПечатнойФормы;
	ПечатнаяФорма.ТабличныйДокумент = ТабДок;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
	
	ОбластиОбъектов = Новый СписокЗначений;
	МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);

	//ДокументыПечатались = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьОтчет()
   УправлениеЭлементамиФормы();
   
   ИмяСтр = Элементы.Страницы.ТекущаяСтраница.Имя;
    
    Если ИмяСтр = "СтраницаНоменклатура" Тогда
		ПоказатьНоменклатуру();
		
	ИначеЕсли ИмяСтр = "СтраницаСпецификации" Тогда
		ПоказатьСпецификации();
		
	ИначеЕсли ИмяСтр = "СтраницаМатериалы" Тогда
		ПоказатьМатериал();
		
	ИначеЕсли ИмяСтр = "СтраницаНоменклатураПоставщиков" Тогда
		ПоказатьНоменклатуруПоставщиков(НоменклатураПоставщиков);

	ИначеЕсли ИмяСтр = "СтраницаКлассификаторы" Тогда
		ПоказатьКлассификаторы();
    
    ИначеЕсли ИмяСтр = "СтраницаПараметрыАналитики" Тогда
    	ПоказатьПараметрыАналитики();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормы()
	Элементы.Цех.Видимость = ОтборПоЦеху;
	
	Элементы.СтраницаПараметрыАналитики.Видимость = Пользователи.РолиДоступны("AMS_Маркетолог");
	
	Элементы.ГруппаСклады.Видимость = (Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаНоменклатура);
	Элементы.ГруппаОтбор.Видимость = Не (Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаПараметрыАналитики);
	
	Элементы.ТоварыГруппаПродукция.Видимость              = ОтборСкладыПродукции;
	Элементы.ТоварыГруппаПроизводство.Видимость           = ОтборСкладыПродукции Или ОтборСкладыМатериалов;
	Элементы.ТоварыГруппаМатериалыВПроизводстве.Видимость = ОтборСкладыМатериалов;
	Элементы.ТоварыГруппаОбразцы.Видимость                = ОтборСкладыПродукции;
	Элементы.ТоварыГруппаПрочие.Видимость                 = ОтборСкладыПрочие; 
КонецПроцедуры

&НаСервере
Процедура ПоказатьНоменклатуру()
	Товары.Очистить();
	
	Если ЗначениеЗаполнено(МемоИерархияНоменклатуры) Тогда 
		Рез = ПолучитьРезультатЗапросаПоНоменклатуре();
		Выб = Рез.Выбрать();
	    НомерСтроки = 0;
		
		Пока Выб.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Стр = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(Стр,Выб);
			Стр.НомерПоПорядку = НомерСтроки;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИерархияНоменклатурыПриАктивизацииСтрокиОбработчикОжидания() Экспорт
	Если МемоИерархияНоменклатуры = Элементы.ИерархияНоменклатуры.ТекущаяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	МемоИерархияНоменклатуры = Элементы.ИерархияНоменклатуры.ТекущаяСтрока;
	
	СформироватьОтчет();
КонецПроцедуры

&НаСервере
Процедура ПоказатьСпецификации()
	Материал  = AMS_ВызовСервера.ВидНоменклатурыМатериал();
	Основные  = AMS_ВызовСервера.ВидНоменклатурыОсновные();
	Расходные = AMS_ВызовСервера.ВидНоменклатурыРасходные();
	Услуга    = AMS_ВызовСервера.ВидНоменклатурыУслуга();
	
	Продукция.Очистить();
	ПродукцияСписокСпецификаций.Очистить();
	СпецификацияПродукции = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник._ВариантыСпецификацийНоменклатуры.ПустаяСсылка");
	
	Если ЗначениеЗаполнено(МемоИерархияНоменклатуры) Тогда 
		Рез = ПолучитьРезультатЗапросаПоНоменклатуре();
		Выб = Рез.Выбрать();
	    НомерСтроки = 0;
		
		Пока Выб.Следующий() Цикл
			Если Не (Выб.ВидНоменклатуры = Материал Или Выб.ВидНоменклатуры = Основные Или Выб.ВидНоменклатуры = Расходные Или Выб.ВидНоменклатуры = Услуга) Тогда 
				НомерСтроки = НомерСтроки + 1;
				Стр = Продукция.Добавить();
				ЗаполнитьЗначенияСвойств(Стр,Выб);
				Стр.НомерПоПорядку = НомерСтроки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПриАктивизацииСтрокиОбработчикОжидания() Экспорт
	Стр = Элементы.Продукция.ТекущиеДанные;
	
	Если Стр <> Неопределено Тогда
		Номенклатура = Стр.Номенклатура;
		
		Если МемоПродукция = Номенклатура Тогда
			Возврат;
		КонецЕсли;
		
		МемоПродукция = Номенклатура;
		ЗаполнитьСписокСпецификаций(МемоПродукция,"ПродукцияСписокСпецификаций");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСпецификаций(Владелец,Таблица)
	Схема = Обработки.AMS_УправлениеЗапасами.ПолучитьМакет("СписокСпецификаций");
	
	Настройки = Схема.НастройкиПоУмолчанию;
	
	ПолеВладелец = Новый ПараметрКомпоновкиДанных("Владелец");
	Для каждого Элемент Из Настройки.ПараметрыДанных.Элементы Цикл
		Если Элемент.Параметр = ПолеВладелец Тогда
			Элемент.Использование = Истина;
			Элемент.Значение = Владелец;
		КонецЕсли;
	КонецЦикла;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(Схема,Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет,,,Истина);
	
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    
    Табл = РеквизитФормыВЗначение(Таблица);
    Табл.Очистить();
	ПроцессорВывода.УстановитьОбъект(Табл);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	ЗначениеВРеквизитФормы(Табл,Таблица);
КонецПроцедуры

&НаСервере
Процедура ПоказатьМатериал()
	Материал = AMS_ВызовСервера.ВидНоменклатурыМатериал();
	Основные = AMS_ВызовСервера.ВидНоменклатурыОсновные();
	Расходные = AMS_ВызовСервера.ВидНоменклатурыРасходные();
	
	Материалы.Очистить();
	ПродукцияФабрикаты.Очистить();
	МатериалыСписокСпецификаций.Очистить();
	СпецификацияМатериала = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник._ВариантыСпецификацийНоменклатуры.ПустаяСсылка");
	
	Если ЗначениеЗаполнено(МемоИерархияНоменклатуры) Тогда 
		Рез = ПолучитьРезультатЗапросаПоНоменклатуре();
		Выб = Рез.Выбрать();
	    НомерСтроки = 0;
		
		Пока Выб.Следующий() Цикл
			Если Выб.ВидНоменклатуры = Материал Или Выб.ВидНоменклатуры = Основные Или Выб.ВидНоменклатуры = Расходные Тогда 
				НомерСтроки = НомерСтроки + 1;
				Стр = Материалы.Добавить();
				ЗаполнитьЗначенияСвойств(Стр,Выб);
				Стр.НомерПоПорядку = НомерСтроки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриАктивизацииСтрокиОбработчикОжидания() Экспорт 
    Стр = Элементы.Материалы.ТекущиеДанные;
    
    Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Номенклатура = Стр.Номенклатура;
    
    Если Номенклатура = МемоМатериал Тогда
		Возврат;
	Иначе
		МемоМатериал = Номенклатура;
	КонецЕсли;
	
    ПоказатьПродукцияФабрикаты(Номенклатура);
КонецПроцедуры

&НаСервере
Процедура ПоказатьПродукцияФабрикаты(Номенклатура)
	МатериалыСписокСпецификаций.Очистить();
	СпецификацияМатериала = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник._ВариантыСпецификацийНоменклатуры.ПустаяСсылка");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("СегментыНоменклатурыСтарая", AMS_ВызовСервера.СегментыНоменклатурыСтарая());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК т
	|ГДЕ
	|	т.Сегмент = &СегментыНоменклатурыСтарая
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Спец.Владелец КАК Номенклатура,
	|	Спец.Владелец.Наименование КАК ВладелецНаименование
	|ИЗ
	|	Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК Тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры КАК Спец
	|		ПО Тов.Ссылка = Спец.Ссылка
	|ГДЕ
	|	НЕ Спец.ПометкаУдаления
	|	И Спец.Статус = ЗНАЧЕНИЕ(Перечисление._СтатусыСпецификаций.Действует)
	|	И Тов.Номенклатура = &Номенклатура
	|	И НЕ Спец.Владелец В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			вт КАК т)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВладелецНаименование";
	Результат = Запрос.Выполнить();
    Выборка   = Результат.Выбрать();
    
	Табл = РеквизитФормыВЗначение("ПродукцияФабрикаты");
	Табл.Очистить();
	
	НомерСтроки = 0;
    Пока Выборка.Следующий() Цикл
		НомерСтроки = НомерСтроки + 1;
        Стр = Табл.Добавить();
        Стр.СистемныеПоляНомерПоПорядку = НомерСтроки;
		Стр.Номенклатура                = Выборка.Номенклатура;
    КонецЦикла; 
	
	ЗначениеВРеквизитФормы(Табл,"ПродукцияФабрикаты");
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияФабрикатыПриАктивизацииСтрокиОбработчикОжидания() Экспорт 
    Стр = Элементы.ПродукцияФабрикаты.ТекущиеДанные;
    
    Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Номенклатура = Стр.Номенклатура;
    
    Если Номенклатура = МемоПродукцияФабрикат Тогда
		Возврат;
	Иначе
		МемоПродукцияФабрикат = Номенклатура;
	КонецЕсли;
	
    ЗаполнитьСписокСпецификаций(Номенклатура,"МатериалыСписокСпецификаций");
КонецПроцедуры

&НаСервере
Процедура ПоказатьНоменклатуруПоставщиков(ТабДок,ЭтоПечать = Ложь)
	ТабДок.Очистить();
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("НоменклатураПоставщиков");
	
	Утверждаю = Макет.ПолучитьОбласть("Утверждаю");
	Шапка     = Макет.ПолучитьОбласть("Шапка");
	Строка_   = Макет.ПолучитьОбласть("Строка_");
	Строка    = Макет.ПолучитьОбласть("Строка");
	Черта     = Макет.ПолучитьОбласть("Черта");

	Если ЭтоПечать Тогда
		ТабДок.Вывести(Утверждаю);
	КонецЕсли;

	ТабДок.Вывести(Шапка);

	Рез = ПолучитьРезультатЗапросаПоНоменклатуреПоставщиков();
	
	НомерСтроки = 0;
	МемоТовар      = Неопределено;
	
	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		Если МемоТовар = Выб.Номенклатура Тогда
			Парам = Строка.Параметры;
			ЗаполнитьЗначенияСвойств(Парам,Выб); 
			
			Парам.Номенклатура = Неопределено; 
			Парам.Код          = Неопределено; 
			Парам.ЕдКод        = Неопределено; 
			Парам.НомерСтроки  = Неопределено;
			
			ТабДок.Вывести(Строка);
		Иначе
			Парам = Строка_.Параметры;
			ЗаполнитьЗначенияСвойств(Парам,Выб); 
			
			НомерСтроки = НомерСтроки + 1;
			Парам.НомерСтроки  = НомерСтроки; 
			
			ТабДок.Вывести(Строка_);
		КонецЕсли;
		
		МемоТовар = Выб.Номенклатура; 
	КонецЦикла; 
	
	ТабДок.Вывести(Черта);
КонецПроцедуры

&НаСервере
Функция ПолучитьРезультатЗапросаПоНоменклатуреПоставщиков()
	Запрос = Новый Запрос;
	
    Если ОтборПоЦеху Тогда
		Сегменты = Новый Массив;
		
		Если Цех = AMS_ВызовСервера.Цех1() Тогда
	    	Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыМатериалыЦеха1());
	    	Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыУпаковкаЦеха1());
		
		ИначеЕсли Цех = AMS_ВызовСервера.Цех2() Тогда
	    	Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыМатериалыЦеха2());
	    	Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыУпаковкаЦеха2());
		
		ИначеЕсли Цех = AMS_ВызовСервера.Цех3() Тогда
	    	Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыМатериалыЦеха3());
	    	Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыУпаковкаЦеха3());
		
		ИначеЕсли Цех = AMS_ВызовСервера.Цех4() Тогда
	    	Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыМатериалыЦеха4());
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ОтборПоЦеху",         ОтборПоЦеху);
	Запрос.УстановитьПараметр("Сегменты",            Сегменты);
	Запрос.УстановитьПараметр("ИерархияНоменклатуры",МемоИерархияНоменклатуры);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	н.Код КАК Код,
	|	т.Упаковка.Код КАК ЕдКод,
	|	т.Упаковка КАК Ед,
	|	т.Ссылка КАК НоменклатураПоставщика,
	|	т.ВладелецНоменклатуры КАК Поставщик,
	|	т.КодОКЕИБазовойЕдиницыИзмерения КАК ЕдКодПоставщика,
	|	т.НаименованиеУпаковки КАК ЕдПоставщика
	|ИЗ
	|	Справочник.НоменклатураКонтрагентов КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК н
	|		ПО т.Номенклатура = н.Ссылка
	|ГДЕ
	|	НЕ т.ПометкаУдаления
	|	И т.Владелец.Поставщик
	|	И НЕ т.Недействителен
	|	И НЕ т.НаименованиеНоменклатуры = т.Номенклатура.Наименование
	|	И НЕ т.Номенклатура В
	|				(ВЫБРАТЬ
	|					т.Номенклатура КАК Номенклатура
	|				ИЗ
	|					РегистрСведений.НоменклатураСегмента КАК т
	|				ГДЕ
	|					т.Сегмент.Наименование = ""Старая"")
	|	И т.Номенклатура В ИЕРАРХИИ(&ИерархияНоменклатуры)
	|	И ВЫБОР
	|			КОГДА &ОтборПоЦеху
	|				ТОГДА т.Номенклатура В
	|						(ВЫБРАТЬ
	|							т.Номенклатура КАК Номенклатура
	|						ИЗ
	|							РегистрСведений.НоменклатураСегмента КАК т
	|						ГДЕ
	|							т.Сегмент В (&Сегменты))
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	н.Наименование";
	
	Возврат Запрос.Выполнить();
КонецФункции

&НаСервере
Процедура ПоказатьКлассификаторы()
	Классификаторы.Очистить();
	
	Если ЗначениеЗаполнено(МемоИерархияНоменклатуры) Тогда 
		Рез = ПолучитьРезультатЗапросаПоНоменклатуре();
		Выб = Рез.Выбрать();
	    НомерСтроки = 0;
		
		Пока Выб.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Стр = Классификаторы.Добавить();
			ЗаполнитьЗначенияСвойств(Стр,Выб);
			Стр.НомерПоПорядку = НомерСтроки;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоказатьПараметрыАналитики()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СкладПродукции", AMS_ВызовСервера.СкладПродукции());
	Запрос.УстановитьПараметр("ВидыНоменклатуры", AMS_ВызовСервера.ВидыНоменклатурыПродукции());
	Запрос.УстановитьПараметр("ВидНоменклатурыПродукцияЦеха1", AMS_ВызовСервера.ВидНоменклатурыПродукцияЦеха1());
	Запрос.УстановитьПараметр("ВидНоменклатурыПродукцияЦеха2", AMS_ВызовСервера.ВидНоменклатурыПродукцияЦеха2());
	Запрос.УстановитьПараметр("ВидНоменклатурыПродукцияЦеха3", AMS_ВызовСервера.ВидНоменклатурыПродукцияЦеха3());
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ном.Артикул КАК Артикул,
		|	т.Номенклатура КАК Номенклатура,
		|	ВЫРАЗИТЬ(ном.НаименованиеПолное КАК СТРОКА(50)) КАК НаименованиеПолное,
		|	ВЫБОР
		|		КОГДА ном.ВидНоменклатуры = &ВидНоменклатурыПродукцияЦеха1
		|			ТОГДА ""Цех 1""
		|		КОГДА ном.ВидНоменклатуры = &ВидНоменклатурыПродукцияЦеха2
		|			ТОГДА ""Цех 2""
		|		КОГДА ном.ВидНоменклатуры = &ВидНоменклатурыПродукцияЦеха3
		|			ТОГДА ""Цех 3""
		|	КОНЕЦ КАК Склад,
		|	РеквНом.Статус КАК Статус,
		|	ном.Марка КАК Бренд,
		|	РеквНом.Вид КАК Вид,
		|	РеквНом.Тип КАК Тип,
		|	РеквНом.Категория КАК Категория,
		|	РеквНом.Назначение КАК Назначение,
		|	РеквНом.МаксимальныйОбъемЗамеса,
		|	РеквНом.МинимальныйОбъемЗамеса,
		|	РеквНом.КоличествоФабрикатаВУпаковке
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Обороты(ДАТАВРЕМЯ(2024, 1, 1),, Регистратор, Склад = &СкладПродукции
		|	И Номенклатура.ВидНоменклатуры В (&ВидыНоменклатуры)) КАК т
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ном
		|		ПО т.Номенклатура = ном.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.AMS_РеквизитыНоменклатуры КАК РеквНом
		|		ПО т.Номенклатура = РеквНом.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаименованиеПолное";
	
	ПродукцияАналитика.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКлассификаторыЗавершение(Результат,ДополнительныеПераметры) Экспорт 
	СформироватьОтчет()
КонецПроцедуры

&НаСервере
Функция ПолучитьРезультатЗапросаПоНоменклатуре()
	Запрос = Новый Запрос;
	
    Если ОтборПоЦеху Тогда
		Сегменты = Новый Массив;
		
		Если Цех = AMS_ВызовСервера.Цех1() Тогда
	    	Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыПродукцияЦеха1());
	    	Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыПолуфабрикатыЦеха1());
	    	Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыМатериалыЦеха1());
	    	Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыУпаковкаЦеха1());
		
		ИначеЕсли Цех = AMS_ВызовСервера.Цех2() Тогда
	    	Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыПродукцияЦеха2());
	    	Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыПолуфабрикатыЦеха2());
	    	Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыМатериалыЦеха2());
	    	Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыУпаковкаЦеха2());
		
		ИначеЕсли Цех = AMS_ВызовСервера.Цех3() Тогда
	    	Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыПродукцияЦеха3());
	    	Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыПолуфабрикатыЦеха3());
	    	Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыМатериалыЦеха3());
	    	Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыУпаковкаЦеха3());
		
		ИначеЕсли Цех = AMS_ВызовСервера.Цех4() Тогда
	    	Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыПродукцияЦеха4());
	    	Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыМатериалыЦеха4());
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ОтборПоЦеху",                 ОтборПоЦеху);
	Запрос.УстановитьПараметр("Сегменты",                    Сегменты);
	Запрос.УстановитьПараметр("ИерархияНоменклатуры",        МемоИерархияНоменклатуры);
	Запрос.УстановитьПараметр("СкладБракованнойПродукции",   AMS_ВызовСервера.СкладБракованнойПродукции());
	Запрос.УстановитьПараметр("СкладКарантин",               AMS_ВызовСервера.СкладКарантин());
	Запрос.УстановитьПараметр("СкладЛаборатория",            AMS_ВызовСервера.СкладЛаборатория());
	Запрос.УстановитьПараметр("СкладМО",                     AMS_ВызовСервера.СкладМО());
	Запрос.УстановитьПараметр("СкладМосква",                 AMS_ВызовСервера.СкладМосква());
	Запрос.УстановитьПараметр("СкладРасходный",              AMS_ВызовСервера.СкладРасходныхМатериалов());
	Запрос.УстановитьПараметр("СкладТНЦ",                    AMS_ВызовСервера.СкладТНЦ());
	Запрос.УстановитьПараметр("СкладПродукции",              AMS_ВызовСервера.СкладПродукции());
	Запрос.УстановитьПараметр("СкладКомпании",               AMS_ВызовСервера.СкладКомпании());
	Запрос.УстановитьПараметр("Цех1",                        AMS_ВызовСервера.Цех1());
	Запрос.УстановитьПараметр("Цех2",                        AMS_ВызовСервера.Цех2());
	Запрос.УстановитьПараметр("Цех3",                        AMS_ВызовСервера.Цех3());
	Запрос.УстановитьПараметр("Цех4",                        AMS_ВызовСервера.Цех4());
	Запрос.УстановитьПараметр("Цех1_МатериалыВПроизводстве", AMS_ВызовСервера.Цех1_МатериалыВПроизводстве());
	Запрос.УстановитьПараметр("Цех2_МатериалыВПроизводстве", AMS_ВызовСервера.Цех2_МатериалыВПроизводстве());
	Запрос.УстановитьПараметр("Цех3_МатериалыВПроизводстве", AMS_ВызовСервера.Цех3_МатериалыВПроизводстве());
	Запрос.УстановитьПараметр("Цех4_МатериалыВПроизводстве", AMS_ВызовСервера.Цех4_МатериалыВПроизводстве());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураСегмента.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ сег
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|ГДЕ
	|	НоменклатураСегмента.Сегмент В (&Сегменты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Ссылка КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА т._Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА т.ЕдиницаДляОтчетов
	|		ИНАЧЕ т._Упаковка
	|	КОНЕЦ КАК Ед,
	|	т.ВидНоменклатуры КАК ВидНоменклатуры,
	|	т.КодТНВЭД КАК КодТНВЭД,
	|	ТНВЭД.Наименование КАК Наименование
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	Справочник.Номенклатура КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК ТНВЭД
	|		ПО т.КодТНВЭД = ТНВЭД.Ссылка
	|ГДЕ
	|	НЕ т.ЭтоГруппа
	|	И т.Ссылка В ИЕРАРХИИ (&ИерархияНоменклатуры)
	|	И ВЫБОР
	|		КОГДА &ОтборПоЦеху
	|			ТОГДА т.Ссылка В
	|				(ВЫБРАТЬ
	|					сег.Номенклатура КАК Номенклатура
	|				ИЗ
	|					сег КАК сег)
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|{ГДЕ
	|	т.Ссылка КАК Номенклатура}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	таб.Номенклатура КАК Номенклатура,
	|	таб.ВНаличииОстаток / таб.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК Количество
	|ПОМЕСТИТЬ Склад
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &СкладПродукции) КАК таб
	|ГДЕ
	|	таб.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	таб.Номенклатура КАК Номенклатура,
	|	таб.ВНаличииОстаток / таб.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК Количество
	|ПОМЕСТИТЬ Цех1
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Цех1) КАК таб
	|ГДЕ
	|	таб.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	таб.Номенклатура КАК Номенклатура,
	|	таб.ВНаличииОстаток / таб.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК Количество
	|ПОМЕСТИТЬ Цех2
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Цех2) КАК таб
	|ГДЕ
	|	таб.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	таб.Номенклатура КАК Номенклатура,
	|	таб.ВНаличииОстаток / таб.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК Количество
	|ПОМЕСТИТЬ Цех3
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Цех3) КАК таб
	|ГДЕ
	|	таб.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	таб.Номенклатура КАК Номенклатура,
	|	таб.ВНаличииОстаток / таб.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК Количество
	|ПОМЕСТИТЬ Цех4
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Цех4) КАК таб
	|ГДЕ
	|	таб.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	таб.Номенклатура КАК Номенклатура,
	|	таб.ВНаличииОстаток / таб.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК Количество
	|ПОМЕСТИТЬ Расход
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &СкладРасходный) КАК таб
	|ГДЕ
	|	таб.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	таб.Номенклатура КАК Номенклатура,
	|	таб.ВНаличииОстаток / таб.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК Количество
	|ПОМЕСТИТЬ Компания
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &СкладКомпании) КАК таб
	|ГДЕ
	|	таб.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	таб.Номенклатура КАК Номенклатура,
	|	таб.ВНаличииОстаток / таб.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК Количество
	|ПОМЕСТИТЬ Брак
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &СкладБракованнойПродукции) КАК таб
	|ГДЕ
	|	таб.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	таб.Номенклатура КАК Номенклатура,
	|	таб.ВНаличииОстаток / таб.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК Количество
	|ПОМЕСТИТЬ Карантин
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &СкладКарантин) КАК таб
	|ГДЕ
	|	таб.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	таб.Номенклатура КАК Номенклатура,
	|	таб.ВНаличииОстаток / таб.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК Количество
	|ПОМЕСТИТЬ Цех1_
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Цех1_МатериалыВПроизводстве) КАК таб
	|ГДЕ
	|	таб.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	таб.Номенклатура КАК Номенклатура,
	|	таб.ВНаличииОстаток / таб.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК Количество
	|ПОМЕСТИТЬ Цех2_
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Цех2_МатериалыВПроизводстве) КАК таб
	|ГДЕ
	|	таб.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	таб.Номенклатура КАК Номенклатура,
	|	таб.ВНаличииОстаток / таб.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК Количество
	|ПОМЕСТИТЬ Цех3_
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Цех3_МатериалыВПроизводстве) КАК таб
	|ГДЕ
	|	таб.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	таб.Номенклатура КАК Номенклатура,
	|	таб.ВНаличииОстаток / таб.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК Количество
	|ПОМЕСТИТЬ Цех4_
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Цех4_МатериалыВПроизводстве) КАК таб
	|ГДЕ
	|	таб.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	таб.Номенклатура КАК Номенклатура,
	|	таб.ВНаличииОстаток / таб.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК Количество
	|ПОМЕСТИТЬ Лаб
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &СкладЛаборатория) КАК таб
	|ГДЕ
	|	таб.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	таб.Номенклатура КАК Номенклатура,
	|	таб.ВНаличииОстаток / таб.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК Количество
	|ПОМЕСТИТЬ Москва
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &СкладМосква) КАК таб
	|ГДЕ
	|	таб.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	таб.Номенклатура КАК Номенклатура,
	|	таб.ВНаличииОстаток / таб.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК Количество
	|ПОМЕСТИТЬ МО
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &СкладМО) КАК таб
	|ГДЕ
	|	таб.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	таб.Номенклатура КАК Номенклатура,
	|	таб.ВНаличииОстаток / таб.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК Количество
	|ПОМЕСТИТЬ ТНЦ
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &СкладТНЦ) КАК таб
	|ГДЕ
	|	таб.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	таб.Номенклатура КАК Номенклатура,
	|	таб.ВНаличииОстаток / таб.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК Количество
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(,) КАК таб
	|ГДЕ
	|	таб.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.Ед КАК Ед,
	|	Склад.Количество КАК Склад,
	|	Брак.Количество КАК Брак,
	|	Карантин.Количество КАК Карантин,
	|	Цех1.Количество КАК Цех1,
	|	Цех2.Количество КАК Цех2,
	|	Цех3.Количество КАК Цех3,
	|	Цех4.Количество КАК Цех4,
	|	Цех1_.Количество КАК Цех1_,
	|	Цех2_.Количество КАК Цех2_,
	|	Цех3_.Количество КАК Цех3_,
	|	Цех4_.Количество КАК Цех4_,
	|	Лаб.Количество КАК Лаб,
	|	Москва.Количество КАК Москва,
	|	МО.Количество КАК МО,
	|	Компания.Количество КАК СкладКомпании,
	|	ТНЦ.Количество КАК ТНЦ,
	|	Расход.Количество КАК Расход,
	|	Итог.Количество КАК Итого,
	|	тов.ВидНоменклатуры КАК ВидНоменклатуры,
	|	тов.КодТНВЭД КАК ТНВЭД,
	|	тов.Наименование КАК Наименование
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Склад КАК Склад
	|		ПО тов.Номенклатура = Склад.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цех1 КАК Цех1
	|		ПО тов.Номенклатура = Цех1.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цех2 КАК Цех2
	|		ПО тов.Номенклатура = Цех2.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цех3 КАК Цех3
	|		ПО тов.Номенклатура = Цех3.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Расход КАК Расход
	|		ПО тов.Номенклатура = Расход.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Компания КАК Компания
	|		ПО тов.Номенклатура = Компания.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Брак КАК Брак
	|		ПО тов.Номенклатура = Брак.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Карантин КАК Карантин
	|		ПО тов.Номенклатура = Карантин.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цех1_ КАК Цех1_
	|		ПО тов.Номенклатура = Цех1_.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цех2_ КАК Цех2_
	|		ПО тов.Номенклатура = Цех2_.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цех3_ КАК Цех3_
	|		ПО тов.Номенклатура = Цех3_.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Лаб КАК Лаб
	|		ПО тов.Номенклатура = Лаб.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Москва КАК Москва
	|		ПО тов.Номенклатура = Москва.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ МО КАК МО
	|		ПО тов.Номенклатура = МО.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТНЦ КАК ТНЦ
	|		ПО тов.Номенклатура = ТНЦ.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Итог КАК Итог
	|		ПО тов.Номенклатура = Итог.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цех4 КАК Цех4
	|		ПО тов.Номенклатура = Цех4.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цех4_ КАК Цех4_
	|		ПО тов.Номенклатура = Цех4_.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	тов.Номенклатура.Наименование";
	
	Возврат Запрос.Выполнить();
КонецФункции

#Область Аналитика

&НаСервере
Процедура ЗаписатьРеквизитНоменклатуры(Реквизит, Номенклатура, Значение)
	УстановитьПривилегированныйРежим(Истина);
	
	Если Реквизит = "Бренд" Тогда
		НоменклатураОбъект = Номенклатура.ПолучитьОбъект();
		НоменклатураОбъект.Марка = Значение;
		НоменклатураОбъект.Записать();
		
	Иначе 	
		Запись = РегистрыСведений.AMS_РеквизитыНоменклатуры.СоздатьМенеджерЗаписи();

		Запись.Номенклатура = Номенклатура;

		Запись.Прочитать();

		Запись.Номенклатура = Номенклатура;
		Запись[Реквизит]    = Значение;

		Запись.Записать(); 
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти
